ode-soap-performance/bpelContent/Multiplication.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Multiplication/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.wscomposition.org/Multiplication/" name="Multiplication">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.wscomposition.org/Multiplication/" schemaLocation="Multiplication.xsd"></xsd:import>
        </xsd:schema>
    </types>
    <message name="MultiplyRequest">
        <part name="firstParam" type="xsd:double"></part>
        <part name="secondParam" type="xsd:double"></part>
    </message>
    <message name="MultiplyRequestResponse">
        <part name="return" type="tns:multiplicationResponse"></part>
    </message>
    <message name="DivideRequest">
        <part name="firstParam" type="xsd:double"></part>
        <part name="secondParam" type="xsd:double"></part>
    </message>
    <message name="DivideRequestResponse">
        <part name="return" type="tns:multiplicationResponse"></part>
    </message>
    <portType name="MultiplicationServiceImpl">
        <operation name="MultiplyRequest" parameterOrder="firstParam secondParam">
            <input wsam:Action="http://www.wscomposition.org/Multiplication/MultiplicationServiceImpl/MultiplyRequestRequest" message="tns:MultiplyRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/Multiplication/MultiplicationServiceImpl/MultiplyRequestResponse" message="tns:MultiplyRequestResponse"></output>
        </operation>
        <operation name="DivideRequest" parameterOrder="firstParam secondParam">
            <input wsam:Action="http://www.wscomposition.org/Multiplication/MultiplicationServiceImpl/DivideRequestRequest" message="tns:DivideRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/Multiplication/MultiplicationServiceImpl/DivideRequestResponse" message="tns:DivideRequestResponse"></output>
        </operation>
    </portType>
    <binding name="MultiplicationSOAPBinding" type="tns:MultiplicationServiceImpl">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
        <operation name="MultiplyRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Multiplication/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Multiplication/"></soap:body>
            </output>
        </operation>
        <operation name="DivideRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Multiplication/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Multiplication/"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="Multiplication">
        <port name="MultiplicationSOAP" binding="tns:MultiplicationSOAPBinding">
            <soap:address location="http://localhost:9005/Multiplication"></soap:address>
        </port>
    </service>
</definitions>