mule-soap-performance/target/mule-soap-performance-1.0.0-SNAPSHOT/WEB-INF/classes/DivideRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mul="http://www.wscomposition.org/Multiplication/">
   <soapenv:Header/>
   <soapenv:Body>
      <mul:DivideRequest>
         <firstParam></firstParam>
         <secondParam></secondParam>
      </mul:DivideRequest>
   </soapenv:Body>
</soapenv:Envelope>